// Задача 13: Напишите программу, которая выводит третью цифру заданного числа
//  или сообщает, что третьей цифры нет.

Console.WriteLine("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());

int thirdNumber 

Console.WriteLine($"{thirdNumber} ");
Console.WriteLine("третьей цифры нет");